---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.GetEnumerator
source: html/4a4f54be-6f2c-e526-8515-58d00364212a.htm
---
# Autodesk.Revit.DB.CurveLoop.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Curve> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.